<?php

class ProblemController extends BaseController {
	public function photo($event, $id){
		$num = 0;
		$dir = 'photo/'.$event.'/problem/'.$id;
		
		if($handle = opendir($dir)){
			while(($file = readdir($handle)) !== false){
				if(!in_array($file, array('.', '..', 'Thumbs.db')) && !is_dir($dir.$file)){
					$num++;
				}
			}
		}
		$num /= 2;
		
		
		$arrDesc = array();
		$arrDesc[2] = array(1 => '原鐵閘已比拆卸, 但留下牆身一大洞孔;應用石英泥先作修補為妥',
							2 => '因整塊鋁窗尚未用玻璃膠完全封口, 所以有些搖搖欲墜; 應完全封口才能離開, 如大風飛墜就會發生危險',
							3 => '可能鋁窗玻璃未到, 留下4個窗孔未裝上(大廳左上,大廳右上,主人房及客房); 應保留原先窗口玻璃或用木板裝上, 待新玻璃送到才替換, 避免雨水入屋',
							4 => '大廳原大廈開口電話位置, 只用英泥馬虎填補',
							5 => '天花牆漆尚未鏟去; 儘管會裝上假天花, 都應要鏟去牆漆, 免日後剝落難清理',
							6 => '門框與牆出現頗大空隙, 相信裝修師傅會等到新門到達才處理, 有待跟進',
							7 => '牆身右上方出現發霉情況, 推斷日前落雨關係, 因房間鋁窗尚未裝上, 濕氣令牆身發霉, 甚至滲漏',
							8 => '牆身出現裂縫; 通知裝修師傅修補妥當才可批灰',
							9 => '全屋牆身油漆尚未鏟清就已批灰, 日後可能會出現油漆剝落',
							10 => '通往主客房走廊出現裂縫並用網膠封上, 要主動要求裝修師傅修補妥當才可批灰, 否則可能只用油漆遮掩, 等到裂縫擴大會令新屋出現裂痕	'
		);
		$arrDesc[3] = array(1 => '大門鐵閘門口外面牆空隙(跟進項目)<br>同樣因拆卸鐵閘已留下一大洞孔; 應用石英泥先作修補為妥(上次應已報告)',
							2 => '大廳原大廈開口電話位置(跟進項目)<br>只用英泥馬虎填補, 並已批灰, 請向師傅查詢(上次應已報告)',
							3 => '大廳左下角鋁窗(跟進項目)<br>師傅已跟進用玻璃膠封口, 但封口馬虎了事',
							4 => '新鋁窗仍未到(跟進項目)<br>可能鋁窗玻璃未到, 留下4個窗孔未裝上(大廳左上,大廳右上,主人房及客房); 應保留原先窗口玻璃或用木板裝上, 待新玻璃送到才替換, 避免雨水入屋 (上次應已報告)',
							5 => '廁所浴缸位置(新)<br>已開始做防漏工作, 但傾斜去水度似乎不足',
							6 => '全屋牆身(跟進項目)<br>牆漆尚未鏟清就已批灰, 日後可能會出現油漆剝落 (已出現裂/坑紋, 日後上油一定不能貼伏, 請重新批灰)',
							7 => '主人房(新)<br>牆身出現裂縫情況, 因廚房加裝電位而鑿穿主人房牆壁, 通知裝修師傅修補妥當',
							8 => '客房牆身(跟進項目)<br>牆身出現裂縫; 通知裝修師傅修批灰補妥 (但仍未處理)',
							9 => '主人房與客房門框空隙(跟進項目)<br>門框與牆出現頗大空隙, 相信裝修師傅會等到新門到達才處理, 有待跟進',
							10 => '通往主客房走廊<br>出現裂縫並用網膠封上, 要求師傅批灰修補 (仍未處理)',
							11 => '大廳B牆壁(新)<br>出現裂縫並用網膠封上, 要求師傅重新批灰修補',
							12 => '大廳B牆壁下角(新)<br>牆壁出現凹陷, 要求裝修師傅作出修補',
							13 => '廚房&廁所天花(跟進項目)<br>天花牆漆尚未鏟去; 儘管會裝上假天花, 都應要鏟去牆漆, 免日後剝落難清理(仍未處理)',
							14 => '廚房舊裝修(新)<br>發現仍有舊電線藏匿or懸掛, 請消除後才批泥'
		);
		$arrDesc[4] = array(1 => '大門鐵閘門口外面牆空隙(跟進項目)<br>同樣因拆卸鐵閘已留下一大洞孔; 應用石英泥先作修補為妥(上次應已報告)',
							2 => '大廳原大廈開口電話位置(跟進項目)<br>只用英泥馬虎填補, 並已批灰, 請向師傅查詢(上次應已報告)',
							3 => '大廳左下角鋁窗(跟進項目)<br>師傅已跟進用玻璃膠封口, 但封口馬虎了事, 而且其他窗口仍未用玻璃膠封口',
							4 => '新鋁窗仍未到(跟進項目)<br>可能鋁窗玻璃未到, 留下4個窗孔未裝上(大廳右上,廁所,主人房及客房); 應保留原先窗口玻璃或用木板裝上, 待新玻璃送到才替換, 避免雨水入屋 (上次應已報告)',
							5 => '廁所浴缸位置(跟進項目)<br>已開始做防漏工作, 但傾斜去水度似乎不足(水平尺見到只向右斜少少)',
							6 => '全屋牆身(跟進項目)<br>牆漆尚未鏟清就已批灰, 日後可能會出現油漆剝落 (已出現裂/坑紋, 日後上油一定不能貼伏, 請重新批灰)',
							7 => '主人房(跟進項目)<br>牆身出現裂縫情況, 因廚房加裝電位而鑿穿主人房牆壁, 通知裝修師傅修補妥當',
							8 => '電制位置(新)<br>電制位置週邊破爛; 通知裝修師傅修整',
							9 => '主人房與客房門框空隙(跟進項目)<br>門框與牆出現頗大空隙, 相信裝修師傅會等到新門到達才處理, 有待跟進',
							10 => '窗檯雲石(新)<br>新裝雲石尚未修補兩側, 甚至底部執漏',
							11 => '廚房&廁所天花(跟進項目)<br>天花牆漆已經鏟去 (這才是真正鏟得清!)',
							12 => '廁所喉(新)<br>發現左右不平衡 (向左斜下)',
							13 => '大廳喉管外露(新)<br>大廳近窗口位置發現喉管, 請通知裝修師傅立即填補, 以免弄破',
							14 => '廁所窗外(新)<br>發現窗外喉管開關位被英泥弄上, 請通知裝修師傅清理',
							15 => '廚房左上角牆身(新)<br>全廚房已鋪上英泥, 唯獨左上角近石油氣錶位未鋪上',
							16 =>'廚房新做鋪磚(新)<br>磚與磚之間縫隙未用英泥好好填滿, 甚至出現移位情況'
		);
		$arrDesc[5] = array(1 => '大門鐵閘門口外面牆空隙(跟進項目)<br>卸鐵閘已留下一大洞孔; 應用石英泥先作修補為妥(上次應已報告)',
							2 => '大廳原大廈開口電話位置(跟進項目)<br>只用英泥馬虎填補, 並已批灰, 請向師傅查詢(上次應已報告)',
							3 => '新鋁窗仍未到(跟進項目)<br>可能鋁窗玻璃未到, 留下4個窗孔未裝上(大廳右上,廁所,主人房及客房); 應保留原先窗口玻璃或用木板裝上, 待新玻璃送到才替換, 避免雨水入屋 (上次應已報告)',
							4 => '廁所浴缸位置(跟進項目)<br>已開始做防漏工作, 仍未完工, 有待跟進',
							5 => '全屋牆身(跟進項目)<br>牆漆尚未鏟清就已批灰, 日後可能會出現油漆剝落 (已出現裂/坑紋, 日後上油一定不能貼伏, 請重新批灰)',
							6 => '主人房(跟進項目)<br>牆身出現裂縫情況, 因廚房加裝電位而鑿穿主人房牆壁, 通知裝修師傅修補妥當',
							7 => '電制位置(跟進項目)<br>裝修師傅已修補電制位置',
							8 => '主人房與客房門框空隙(跟進項目)<br>門框與牆出現頗大空隙, 相信裝修師傅會等到新門到達才處理, 有待跟進',
							9 => '窗檯雲石(跟進項目)<br>新裝雲石尚未修補兩側, 甚至底部執漏',
							10 => '大廳喉管外露(跟進項目)<br>大廳近窗口位置發現喉管, 請通知裝修師傅立即填補, 以免弄破',
							11 => '廁所窗外(跟進項目)<br>發現窗外喉管開關位被英泥弄上, 請通知裝修師傅清理',
							12 => '廚房左上角牆身(新)<br>全廚房已鋪上牆磚, 但左上角牆磚出現裂縫',
							13 => '廚房新做鋪磚(跟進項目)<br>磚與磚之間縫隙已用英泥填滿, 兩邊左右平衡',
							14 => '廚房新做鋪磚(新)<br>發現入門位上面尚未鋪磚, 未知是否廚房假天花位置, 有待跟進',
							15 => '地磚(新)<br>發現新到地磚有數塊出現崩裂, 師傅有待追討供應商',
							16 => '入牆櫃位置(新)<br>因放置雜物已未批灰, 有待跟進',
		);
		
		$arrDesc[6] = array(1 => '大門鐵閘門口外面牆空隙(跟進項目)<br>同樣因拆卸鐵閘已留下一大洞孔; 應用石英泥先作修補為妥(上次應已報告)',
							2 => '大廳原大廈開口電話位置(跟進項目)<br>只用英泥馬虎填補, 並已批灰, 請向師傅查詢(上次應已報告)',
							3 => '鋁窗(跟進項目)<br>留下4個窗孔未裝上(大廳右上,廁所,主人房及客房); 應保留原先窗口玻璃或用木板裝上, 待新玻璃送到才替換, 避免雨水入屋 (上次應已報告)',
							4 => '廁所浴缸位置(跟進項目)<br>已做防漏工作並完工, 但因用帆布蓋上, 有待跟進',
							5 => '全屋牆身(跟進項目)<br>牆漆尚未鏟清就已批灰, 日後可能會出現油漆剝落 (已出現裂/坑紋, 日後上油一定不能貼伏, 請重新批灰)',
							6 => '主人房(跟進項目)<br>牆身出現裂縫情況, 因廚房加裝電位而鑿穿主人房牆壁, 通知裝修師傅修補妥當(上次應已報告)',
							7 => '主人房與客房門框空隙(跟進項目)<br>門框與牆出現頗大空隙, 相信裝修師傅會等到新門到達才處理, 有待跟進',
							8 => '窗檯雲石(跟進項目)<br>新裝雲石尚未修補兩側, 甚至底部執漏',
							9 => '廚房喉管外露(跟進項目)<br>廚房已鋪地磚',
							10 => '廁所窗外(跟進項目)<br>發現窗外喉管開關位被英泥弄上, 請通知裝修師傅清理(上次應已報告)',
							11 => '廚房左上角牆身(跟進項目)<br>左上角牆磚已被吊櫃遮掩, 但吊櫃內部切口不齊, 請通知裝修師傅處理',
							12 => '廚房新做鋪磚(跟進項目)<br>發現入門位上面尚未鋪磚, 未知是否廚房假天花位置, 有待跟進',
							13 => '入牆櫃位置(跟進項目)<br>因放置雜物已未批灰, 有待跟進',
							14 => '大門位置(新)<br>發現門框有空隙, 請通知裝修師傅處理',
							15 => '門與牆壁(新)<br>發現每道門質牆壁之間缺少了門擋(可防止開門時撞花牆壁)',
							16 => '廁所企缸位置及地面(新)<br>發現鋪完地磚, 斜度並不是流向渠口, 請通知裝修師傅處理',
							17 => '櫃門與牆壁(新)<br>發現櫃門與牆壁之間太貼, 容易弄到牆壁, 應加防撞膠最好',
							18 => '磁磚角位(新)<br>由於本身磁磚面不是平, 所以應用多些白英泥封好, 以免割傷',
							19 => '廁所及廚房門口(新)<br>尚未用地磚鋪好, 請通知裝修師傅處理',
							20 => '廚房窗與吊櫃之間(新)<br>由廚房伸出窗外向上望, 發現尚未批灰, 請通知裝修師傅處理',
							21 => '廚房吊櫃與牆壁(新)<br>廚房吊櫃與牆壁尚有空隙, 請通知裝修師傅處理',
							22 => '地磚縫隙(新)<br>地腳縫口尚未用做好, 請通知裝修師傅處理'
		);
		
		$arrDesc[7] = array(1 => '大門門口外面牆空隙(跟進項目)<br>大門門口已補大洞孔, 但不能接受',
							2 => '大廳原大廈開口電話位置(跟進項目)<br>已修補並塗上油漆',
							3 => '鋁窗(跟進項目)<br>3個窗孔已裝上冷氣機(大廳右上,主人房及客房), 唯獨廁所抽氣扇仍未裝上, 有待跟進',
							4 => '廁所浴缸位置(跟進項目)<br>已做防漏工作並完工, 但因用帆布蓋上, 有待跟進',
							5 => '全屋牆身(跟進項目)<br>牆身已批好並塗上油漆',
							6 => '主人房(跟進項目)<br>牆身修補妥當並塗上油漆',
							7 => '主人房與客房門框空隙(跟進項目)<br>門框與牆修補妥當',
							8 => '窗檯雲石(跟進項目)<br>窗檯雲石兩側修補妥當',
							9 => '廁所窗外(跟進項目)<br>發現窗外喉管開關位被英泥弄上, 請通知裝修師傅清理(上次應已報告)',
							10 => '廚房左上角牆身(跟進項目)<br>左上角牆磚已被吊櫃遮掩, 但吊櫃內部切口不齊, 請通知裝修師傅處理(上次應已報告)',
							11 => '廚房新做鋪磚(跟進項目)<br>廚房假天花已裝上',
							12 => '大門位置(跟進項目)<br>發現門框與地腳有空隙, 請通知裝修師傅處理(上次應已報告)',
							13 => '門與牆壁(跟進項目)<br>發現每道門質牆壁之間缺少了門擋(可防止開門時撞花牆壁)(上次應已報告)',
							14 => '櫃門與牆壁(跟進項目)<br>發現櫃門與牆壁之間太貼, 容易弄到牆壁, 應加防撞膠最好(上次應已報告)',
							15 => '磁磚角位(跟進項目)<br>由於本身磁磚面不是平, 所以應用多些白英泥封好, 以免割傷(上次應已報告)',
							16 => '廁所及廚房門口(跟進項目)<br>地腳已鋪好, 但兩側仍有直隙, 請通知裝修師傅處理',
							17 => '廚房窗與吊櫃之間(跟進項目)<br>由廚房伸出窗外向上望, 發現尚未批灰, 請通知裝修師傅處理(上次應已報告)',
							18 => '廚房吊櫃與牆壁(跟進項目)<br>廚房吊櫃與牆壁已修補',
							19 => '電製位(新)<br>其他已經做好, 但仍有兩個尚未完成',
							20 => '門框與牆身(新)<br>因牆磚本身設計呈現波浪形, 因此門框不能貼晒牆身, 因塗上膠封口',
							21 => '廁所座廁(新)<br>新座廁接口應再用防水膠布封口',
							22 => '地櫃連接水管位(新)<br>藏入地櫃內的水管位應用白英泥封口',
							23 => '廚房右邊洗衣機空間(新)<br>地櫃仍未開孔給洗衣機去水口',
							24 => '廚房盆(新)<br>去水位周邊膠不均',
							25 => '廚房電製(新)<br>發現廚房電製不發亮(應熄燈後發亮)',
							26 => '大門門口燈位(新)<br>因燈仍未裝上, 有待跟進'
		);
		
		//Update Date
		$date = array('-',
					'2014年6月01日',
					'2014年6月11日',
					'2014年6月16日',
					'2014年6月22日',
					'2014年6月22日',
					'2014年7月13日',
					'2014年7月26日',
					'-');
		
		
		return View::make('problem/photo', array('numOfPhoto' => $num,
											'event' => $event,
											'problem_id' => $id,
											'desc' => $arrDesc[$event],
											'date' => $date[$event]));		
	}
	
	public function video($event, $id){
	

			$arrVideo = array();
			$arrDesc = array();

			$arrVideo[2] = array(
							2 => array('CopZZr7J4w8'),
							7 => array('iqTqx2l6vOc'),
							9 => array('y9clqejrvOw', 'RWvgVy1NgT8'),
							10 => array('lwrSlzH2YBk', '3jqxu8mczNs')
			);
			
			$arrDesc[2] = array(2 => '玻璃窗未用玻璃膠完全封口,出現搖搖欲墜; 加上窗較開關不暢順, 要利用窗較托起整塊鋁窗',
							7 => '牆身右上方出現發霉徵狀, 推斷日前落雨關係, 因房間鋁窗尚未裝上, 濕氣令牆身發霉, 甚至滲漏',
							9 => '牆漆尚未鏟清就已批灰, 油漆會未能貼伏牆身, 日後可能會出現油漆剝落',
							10 => '出現裂縫並用網膠封上, 要主動要求裝修師傅修補妥當才可批灰, 否則可能只用批灰油漆遮掩, 等到裂縫再擴大令新屋裂痕重現');
									
		
		//Update Date
		$date = array('-',
					'2014年6月01日',
					'2014年6月11日',
					'-',
					'-',
					'-');
		
	
		return View::make('problem/video', array('numOfVideo' => 2,
											'event' => $event,
											'problem_id' => $id,
											'arrVideo' => $arrVideo[$event],
											'arrDesc' => $arrDesc[$event],
											'date' => $date[$event]));
											
	}
}